BojanJurca/Esp32_oscilloscope/httpServer.hpp
/*

    httpServer.hpp 
  
    This file is part of Esp32_web_ftp_telnet_server_template project: https://github.com/BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino
  
    HTTP server can serve some HTTP requests itself (for example content of .html and other files) but the calling program
    can also provide its own httpRequestHandlerCallback function. Cookies and page redirection are supported. There is also
    a small "database" to keep valid web session tokens in order to support web login. Text and binary WebSocket straming is
    also supported.
  
    December 25, 2023, Bojan Jurca

    Nomenclature used here for easier understaning of the code:

     - "connection" normally applies to TCP connection from when it was established to when it is terminated

                  Looking back to HTTP 1.0 protocol one TCP connection was used to transmit oparamene HTTP request from browser to web server
                  and then HTTP response back to the browser. After this TCP connection was terminated. HTTP 1.1 introduced "keep-alive"
                  directive. When the browser requests several pages from server it can do it over the same TCP connection in short time period 
                  (one after another) reducing the need of establishing and terminating TCP connections several times.   

     - "session" applies to user interaction between login and logout

                  Taking account the web technology one web session tipically consists of many TCP connections. Cookies are involved
                  in order to preserve the state of the web session since HTTP requests and replies themselves are stateless. A list of 
                  valid "session tokens" is keept on the web server so web server can check the session validity.

      - "buffer size" is the number of bytes that can be placed in a buffer. 
      
                  In case of C 0-terminated strings the terminating 0 character should be included in "buffer size".


      - "HTTP request":

                   ---------------  GET / HTTP/1.1
                  |                 Host: 10.18.1.200
                  |                 Connection: keep-alive    field value
                  |                 Cache-Control: max-age=0   |
         request  |    field name - Upgrade-Insecure-Requests: 1
                  |                 User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.45 Safari/537.36
                  |                 Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng;q=0.8,application/signed-exchange;v=b3;q=0.9
                  |                 Accept-Encoding: gzip, deflate
                  |                 Accept-Language: sl-SI,sl;q=0.9,en-GB;q=0.8,en;q=0.7
                  |                 Cookie: refreshCounter=1
                  |                             |          |
                  |                        cookie name   cookie value
                   ---------------     
       
      - "HTTP reply":
                                                    status
                                                       |         cookie name, value, path and expiration
                   --------  ---------------  HTTP/1.1 200 OK      |     |    |         |
                  |         |                 Set-Cookie: refreshCounter=2; Path=/; Expires=Thu, 09 Dec 2021 19:07:04 GMT
            reply |  header |    field name - Content-Type: text/html
                  |         |                 Content-Length: 96   |
                  |          ---------------                      field value
                   - content ---------------  <HTML>Web cookies<br><br>This page has been refreshed 2 times. Click refresh to see more.</HTML>
                  
*/


    // ----- includes, definitions and supporting functions -----

    #include <WiFi.h>
    // needed for web sockets
    #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL (4, 4, 0) // Checks if board manager version for esp32 is >= 2.0.0 - thank you Ziss (https://github.com/Ziss)
      #include <sha/sha_parallel_engine.h>    // needed for websockets support
    #else
      #include <hwcrypto/sha.h>               // needed for websockets support
    #endif
    #include <mbedtls/base64.h>
    #include <mbedtls/md.h>
    // fixed size strings    
    #include "fsString.h"
                                                                

#ifndef __HTTP_SERVER__
  #define __HTTP_SERVER__

    #ifdef HTTP_SERVER_CORE
        #ifdef SHOW_COMPILE_TIME_INFORMATION
            #pragma message "httpServer will run only on #defined core"
        #endif
    #endif

    #ifndef __FILE_SYSTEM__
      #ifdef SHOW_COMPILE_TIME_INFORMATION
          #pragma message "Compiling httpServer.h without file system (fileSystem.hpp), httpServer will not be able to serve files"
      #endif
    #endif
  

    // ----- TUNNING PARAMETERS -----

    #ifndef HTTP_CONNECTION_STACK_SIZE
        #define HTTP_CONNECTION_STACK_SIZE 8 * 1024             // TCP connections' stack size
    #endif
    // #define HTTP_SERVER_CORE 1 // 1 or 0                     // #define HTTP_SERVER_CORE if you want httpServer to run on specific core
    #define HTTP_BUFFER_SIZE 1500                               // reading and temporary keeping HTTP requests, buffer for constructing HTTP reply, MTU = 1500
    #define HTTP_CONNECTION_TIME_OUT 3000                       // 3000 ms for HTTP requests, 0 for infinite
    #define HTTP_REPLY_STATUS_MAX_LENGTH 32                     // only first 3 characters are important
    #define HTTP_WS_FRAME_MAX_SIZE 1500                         // WebSocket send frame size and also read frame size (there are 2 buffers), MTU = 1500
    #define HTTP_CONNECTION_WS_TIME_OUT 300000                  // 300000 ms = 5 min for WebSocket connections, 0 for infinite
    // #define WEB_SESSIONS                                        // comment this line out if you won't use web sessions
    #ifdef WEB_SESSIONS
        #define WEB_SESSION_TIME_OUT 300                        // 300 s = 5 min, 0 for infinite

        #include "persistentKeyValuePairs.h"

        typedef fsString<64> webSessionToken_t;
        struct webSessionTokenInformation_t {
            time_t expires; // web session toke expiration time in GMT
            fsString<64> userName; // USER_PASSWORD_MAX_LENGTH = 64
        };

        persistentKeyValuePairs<webSessionToken_t, webSessionTokenInformation_t> webSessionTokenDatabase; // a database containing valid web session tokens

    #endif

    // please note that the limit for getHttpRequestHeaderField and getHttpRequestCookie return values are defined by string #definition in fsString.h

    #define reply400 "HTTP/1.0 400 Bad request\r\nConnection: close\r\nContent-Length:34\r\n\r\nFormat of HTTP request is invalid."
    #define reply404 "HTTP/1.0 404 Not found\r\nConnection: close\r\nContent-Length:10\r\n\r\nNot found."
    #define reply503 "HTTP/1.0 503 Service unavailable\r\nConnection: close\r\nContent-Length:39\r\n\r\nHTTP server is not available right now."
    #define reply507 "HTTP/1.0 507 Insuficient storage\r\nConnection: close\r\nContent-Length:41\r\n\r\nThe buffers of HTTP server are too small."


    // ----- CODE -----

