BojanJurca/Esp32_oscilloscope/httpServer.hpp
    #include "dmesg_functions.h"
    #ifndef __TIME_FUNCTIONS__
        #ifdef SHOW_COMPILE_TIME_INFORMATION
            #pragma message "Implicitly including time_functions.h (needed to calculate expiration time of cookies)"
        #endif
      #include "time_functions.h"
    #endif
    
    #ifndef __STRISTR__
      #define __STRISTR__
      // missing C function in Arduino
      char *stristr (char *haystack, char *needle) { 
        if (!haystack || !needle) return NULL; // nonsense
        int nCheckLimit = strlen (needle);                     
        int hCheckLimit = strlen (haystack) - nCheckLimit + 1;
        for (int i = 0; i < hCheckLimit; i++) {
          int j = i;
          int k = 0;
          while (*(needle + k)) {
              char nChar = *(needle + k ++); if (nChar >= 'a' && nChar <= 'z') nChar -= 32; // convert to upper case
              char hChar = *(haystack + j ++); if (hChar >= 'a' && hChar <= 'z') hChar -= 32; // convert to upper case
              if (nChar != hChar) break;
          }
          if (!*(needle + k)) return haystack + i; // match!
        }
        return NULL; // no match
      }
    #endif

    #ifndef __SHA256__
      #define __SHA256__
        bool sha256 (char *buffer, size_t bufferSize, const char *clearText) { // converts clearText to 265 bit SHA, returns character representation in hexadecimal format of hash value
          *buffer = 0;
          byte shaByteResult [32];
          static char shaCharResult [65];
          mbedtls_md_context_t ctx;
          mbedtls_md_type_t md_type = MBEDTLS_MD_SHA256;
          mbedtls_md_init (&ctx);
          mbedtls_md_setup (&ctx, mbedtls_md_info_from_type (md_type), 0);
          mbedtls_md_starts (&ctx);
          mbedtls_md_update (&ctx, (const unsigned char *) clearText, strlen (clearText));
          mbedtls_md_finish (&ctx, shaByteResult);
          mbedtls_md_free (&ctx);
          for (int i = 0; i < 32; i++) sprintf (shaCharResult + 2 * i, "%02x", (int) shaByteResult [i]);
          if (bufferSize > strlen (shaCharResult)) { strcpy (buffer, shaCharResult); return true; }
          return false; 
        }
    #endif    


    // control httpServer critical sections
    static SemaphoreHandle_t __httpServerSemaphore__ = xSemaphoreCreateMutex (); 

    // log what is going on within httpServer
    byte httpServerConcurentTasks = 0;
    byte httpServerConcurentTasksHighWatermark = 0;

    // ----- WebSocket class -----
  
    class WebSocket {  
    
      public:

        // WebSocket state
        enum STATE_TYPE {
          NOT_RUNNING = 0, 
          RUNNING = 2        
        };

        STATE_TYPE state () { return __state__; }
    
        WebSocket ( // the following parameters will be handeled by WebSocket instance
                    int connectionSocket,
                    char *wsRequest,
                    char *clientIP, char *serverIP
                  ) {
                      // create a local copy of parameters for later use
                      __connectionSocket__ = connectionSocket;
                      __wsRequest__ = wsRequest;
                      __clientIP__ = clientIP;
                      __serverIP__ = serverIP;

                      // do the handshake with the browser so it would consider webSocket connection established
                      char *i = stristr (wsRequest, (char *) "SEC-WEBSOCKET-KEY: ");
                      if (i) {
                        i += 19;
                        char *j = strstr (i, "\r\n");
                        if (j) {
                          if (j - i <= 24) { // Sec-WebSocket-Key is not supposed to exceed 24 characters
                            char key [25]; memcpy (key, i, j - i); key [j - i] = 0; 
                            // calculate Sec-WebSocket-Accept
                            char s1 [64]; strcpy (s1, key); strcat (s1, (char *) "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"); 
                            #define SHA1_RESULT_SIZE 20
                            unsigned char s2 [SHA1_RESULT_SIZE]; esp_sha (SHA1, (unsigned char *) s1, strlen (s1), s2);
                            #define WS_CLIENT_KEY_LENGTH 24
                            size_t olen = WS_CLIENT_KEY_LENGTH;
                            char s3 [32];
                            mbedtls_base64_encode ((unsigned char *) s3, 32, &olen, s2, SHA1_RESULT_SIZE);
                            // compose websocket accept response and send it back to the client
                            char buffer  [255]; // 255 will do
                            sprintf (buffer, "HTTP/1.1 101 Switching Protocols \r\nUpgrade: websocket\r\nConnection: Upgrade\r\nSec-WebSocket-Accept: %s\r\n\r\n", s3);
                            if (sendAll (connectionSocket, buffer, HTTP_CONNECTION_WS_TIME_OUT) == strlen (buffer)) {
                              __state__ = RUNNING;
                            }
                          } else { // |key| > 24
                            dmesg ("[WebSocket] WsRequest key too long");
                          }
                        } else { // j == NULL
                          dmesg ("[WebSocket] WsRequest without key");
                        }
                      } else { // i == NULL
                        dmesg ("[WebSocket] WsRequest without key");
                      }

                    }
          
        ~WebSocket () { 
                        // send closing frame if possible
                        __sendFrame__ (NULL, 0, WebSocket::CLOSE);
                        closeWebSocket ();
                      } 

        int getSocket () { return __connectionSocket__; }

        char *getClientIP () { return __clientIP__; }

        char *getServerIP () { return __serverIP__; }
  
        void closeWebSocket ()  { 
                                  // close connection socket
                                  int connectionSocket;
                                  xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                                    connectionSocket = __connectionSocket__;
                                    __connectionSocket__ = -1;
                                  xSemaphoreGive (__httpServerSemaphore__);
                                  if (connectionSocket > -1) close (connectionSocket);                      
                                }

        char *getWsRequest () { return __wsRequest__; }
    
        enum WEBSOCKET_DATA_TYPE {
          NOT_AVAILABLE = 0,          // no data is available to be read 
          STRING = 1,                 // text data is available to be read
          BINARY = 2,                 // binary data is available to be read
          CLOSE = 8,                  // used internally for closing frame      
          ERROR = 10,                 // error in TCP communication
          TIME_OUT = 11               // time-out detected
        };
   
