BojanJurca/Esp32_oscilloscope/httpServer.hpp
      public:

        // httpConnection state
        enum STATE_TYPE {
          NOT_RUNNING = 0, 
          RUNNING = 2        
        };

        STATE_TYPE state () { return __state__; }

        httpConnection ( // the following parameters will be handeled by httpConnection instance
                         int connectionSocket,
                         String (*httpRequestHandlerCallback) (char *httpRequest, httpConnection *hcn), // httpRequestHandler callback function provided by calling program
                         void (*wsRequestHandlerCallback) (char *wsRequest, WebSocket *webSocket),      // wsRequestHandler callback function provided by calling program      
                         const char *clientIP, 
                         char *serverIP,
                         const char *httpServerHomeDirectory = (char *) "/var/www/html"
                       )  {
                              // create a local copy of parameters for later use
                              __connectionSocket__ = connectionSocket;
                              __httpRequestHandlerCallback__ = httpRequestHandlerCallback;
                              __wsRequestHandlerCallback__ = wsRequestHandlerCallback;
                              strncpy (__clientIP__, clientIP, sizeof (__clientIP__)); __clientIP__ [sizeof (__clientIP__) - 1] = 0; // copy client's IP since connection may live longer than the server that created it
                              strncpy (__serverIP__, serverIP, sizeof (__serverIP__)); __serverIP__ [sizeof (__serverIP__) - 1] = 0; // copy server's IP since connection may live longer than the server that created it
                              #ifdef __FILE_SYSTEM__
                                  // we have done the checking in httpServer constructor, there is no need to repeat the checking in httpCOnnection constructor agin
                                  // if (!httpServerHomeDirectory || !*httpServerHomeDirectory || strlen (httpServerHomeDirectory) >= sizeof (__httpServerHomeDirectory__) - 2) {
                                  //     dmesg ("[httpConnection] invalid httpServerHomeDirectory");
                                  //     return;
                                  // }
                                  // but we have to keep a local copy of httpServerHomeDirectory since the server can stop before the connection it created gets closed
                                  strcpy (__httpServerHomeDirectory__, httpServerHomeDirectory);
                                  if (__httpServerHomeDirectory__ [strlen (__httpServerHomeDirectory__) - 1] != '/') strcat (__httpServerHomeDirectory__, "/"); // __httpServerHomeDirectory__ always ends with /
                              #endif

                              // handle connection in its own thread (task)
                              // if running out of memory, creation of the new task would fail, so try multiple times before reporting an error
                              #define tskNORMAL_PRIORITY 1
                              for (int i = 0; i < 30; i++) { // try 3 s
                                  #ifdef HTTP_SERVER_CORE
                                      BaseType_t taskCreated = xTaskCreatePinnedToCore (__connectionTask__, "httpConnection", HTTP_CONNECTION_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL, HTTP_SERVER_CORE);
                                  #else
                                      BaseType_t taskCreated = xTaskCreate (__connectionTask__, "httpConnection", HTTP_CONNECTION_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL);
                                  #endif
                                  if (pdPASS != taskCreated) {
                                      delay (100);
                                  } else {
                                      __state__ = RUNNING;

                                      xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                                          httpServerConcurentTasks++;
                                          if (httpServerConcurentTasks > httpServerConcurentTasksHighWatermark)
                                              httpServerConcurentTasksHighWatermark = httpServerConcurentTasks;
                                      xSemaphoreGive (__httpServerSemaphore__);

                                      return; // success
                                  }
                              }
                              dmesg ("[httpConnection] xTaskCreate error"); // failure
                          }

        ~httpConnection ()  {
                              // close connection socket
                              int connectionSocket;
                              xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                                  connectionSocket = __connectionSocket__;
                                  __connectionSocket__ = -1;
                                
                                  httpServerConcurentTasks--;
                              xSemaphoreGive (__httpServerSemaphore__);
                              if (connectionSocket > -1) close (connectionSocket);
                            }

        int getSocket () { return __connectionSocket__; }

        char *getClientIP () { return __clientIP__; }

        char *getServerIP () { return __serverIP__; }

        char *getHttpRequest () { return __httpRequestAndReplyBuffer__; }

        string getHttpRequestHeaderField (char *fieldName) { // HTTP header fields are in format \r\nfieldName: fieldValue\r\n
          char *p = stristr (__httpRequestAndReplyBuffer__, fieldName); 
          if (p && p != __httpRequestAndReplyBuffer__ && *(p - 1) == '\n' && *(p + strlen (fieldName)) == ':') { // p points to fieldName in HTTP request
            p += strlen (fieldName) + 1; while (*p == ' ') p++; // p points to field value in HTTP request
            string s; while (*p >= ' ') s += *(p ++);
            return s;
          }
          return "";
        }

        string getHttpRequestCookie (const char *cookieName) { // cookies are passed from browser to http server in "cookie" HTTP header field
          char *p = stristr (__httpRequestAndReplyBuffer__, (char *) "\nCookie:"); // find cookie field name in HTTP header          
          if (p) {
            p = strstr (p, cookieName); // find cookie name in HTTP header
            if (p && p != __httpRequestAndReplyBuffer__ && *(p - 1) == ' ' && *(p + strlen (cookieName)) == '=') {
              p += strlen (cookieName) + 1; while (*p == ' ' || *p == '=' ) p++; // p points to cookie value in HTTP request
              string s; while (*p > ' ' && *p != ';') s += *(p ++);
              return s;
            }
          }
          return "";
        }

        void setHttpReplyStatus (const char *status) { strncpy (__httpReplyStatus__, status, HTTP_REPLY_STATUS_MAX_LENGTH); __httpReplyStatus__ [HTTP_REPLY_STATUS_MAX_LENGTH - 1] = 0; }
        
        void setHttpReplyHeaderField (string fieldName, string fieldValue) { 
            __httpReplyHeader__ += fieldName;
            __httpReplyHeader__ +=  + ": ";
            __httpReplyHeader__ += fieldValue;
            __httpReplyHeader__ += "\r\n"; 
        }

        void setHttpReplyCookie (string cookieName, string cookieValue, time_t expires = 0, string path = "/") { 
          char e [50] = "";
          if (expires) {
              if (!time ()) { // time not set
                  dmesg ("[httpConnection] could not set cookie expiration time since the current time has not been set yet");
                  return;
              }
              struct tm st = gmTime (expires);
              strftime (e, sizeof (e), "; Expires=%a, %d %b %Y %H:%M:%S GMT", &st);
          }
          // save whole fieldValue into cookieName to save stack space
          cookieName += "=";
          cookieName += cookieValue;
          cookieName += "; Path=";
          cookieName += path;
          cookieName += e;
          setHttpReplyHeaderField ("Set-Cookie", cookieName);
        }

        // combination of clientIP and User-Agent HTTP header field - used for calculation of web session token
        String getClientSpecificInformation () { return String (__clientIP__) + getHttpRequestHeaderField ((char *) "User-Agent"); }


        // support for web sessions
        #ifdef WEB_SESSIONS

            // calculates new token from random number and client specific information
            webSessionToken_t newWebSessionToken (char *userName, time_t expires) { 
                // generate new token
                static int tokenCounter = 0;
                webSessionToken_t webSessionToken;
                sha256 (webSessionToken.c_str (), 64 + 1, (char *) (String (tokenCounter ++) + String (esp_random ()) + String (__clientIP__) + getHttpRequestHeaderField ((char *) "User-Agent")).c_str ());
                
                // insert the new token into token database together with information associated with it
                persistentKeyValuePairs<webSessionToken_t, webSessionTokenInformation_t>::errorCode e;
                webSessionTokenDatabase.Insert (webSessionToken, {expires, userName}); // if Insert fails, the token will just not work
                if (e != webSessionTokenDatabase.OK) dmesg ("[httpConnection] webSessionTokenDatabase.Insert error: ", e); 
                              
                return webSessionToken;
            }

            // check validity of a token in webSessionTokenDatabase
            fsString<64> getUserNameFromToken (webSessionToken_t& webSessionToken) {
                // find token in the webSessionTokenDatabase
                webSessionTokenInformation_t webSessionTokenInformation;
                persistentKeyValuePairs<webSessionToken_t, webSessionTokenInformation_t>::errorCode e;
                e = webSessionTokenDatabase.FindValue (webSessionToken, &webSessionTokenInformation);
                switch (e) {
                    case webSessionTokenDatabase.OK:        if ((time () && webSessionTokenInformation.expires <= time ()) || webSessionTokenInformation.expires == 0)  
                                                                return "";
                                                            else
                                                                return webSessionTokenInformation.userName;
                    case webSessionTokenDatabase.NOT_FOUND: return "";
                    default:                                dmesg ("[httpConnection] webSessionTokenDatabase.FindValue error: ", e); 
                                                            return "";
                }
            }

            // updates the token in webSessionTokenDatabase
            bool updateWebSessionToken (webSessionToken_t& webSessionToken, fsString<64>& userName, time_t expires) {
                return (webSessionTokenDatabase.Update (webSessionToken, {expires, userName}) == webSessionTokenDatabase.OK);
            }

