BojanJurca/Esp32_oscilloscope/httpServer.hpp
            // deletes the token from webSessionTokenDatabase
            bool deleteWebSessionToken (webSessionToken_t& webSessionToken) {
                return (webSessionTokenDatabase.Delete (webSessionToken) == webSessionTokenDatabase.OK);
            }

        #endif

                                                                                                  
      private:

        STATE_TYPE __state__ = NOT_RUNNING;
    
        int __connectionSocket__ = -1;
        String (* __httpRequestHandlerCallback__) (char *httpRequest, httpConnection *hcn) = NULL;
        void (* __wsRequestHandlerCallback__) (char *wsRequest, WebSocket *webSocket) = NULL;        
        char __clientIP__ [46] = "";
        char __serverIP__ [46] = "";

        #ifdef __FILE_SYSTEM__
            char __httpServerHomeDirectory__ [FILE_PATH_MAX_LENGTH] = "/var/www/html";
        #else
            char *__httpServerHomeDirectory__; // not used
        #endif

        fsString<HTTP_BUFFER_SIZE> __httpRequestAndReplyBuffer__;

        char  __httpReplyStatus__ [HTTP_REPLY_STATUS_MAX_LENGTH] = "200 OK"; // by default
        string __httpReplyHeader__ = ""; // by default

        static void __connectionTask__ (void *pvParameters) {
          // get "this" pointer
          httpConnection *ths = (httpConnection *) pvParameters;           
          { // code block
            // READ HTTP REQUEST READ HTTP REQUEST READ HTTP REQUEST READ HTTP REQUEST READ HTTP REQUEST READ HTTP REQUEST READ HTTP REQUEST READ HTTP REQUEST 
            
            int receivedTotal = 0;
            bool keepAlive;
            char *endOfHttpRequest = NULL;
            do {
              keepAlive = false;
              receivedTotal = recvAll (ths->__connectionSocket__, ths->__httpRequestAndReplyBuffer__.c_str () + receivedTotal, HTTP_BUFFER_SIZE - 1 - receivedTotal, (char *) "\r\n\r\n", HTTP_CONNECTION_TIME_OUT); // BJ remark: is - 1 necessary? recvAll already considers C string ending with 0 itself.
              if (receivedTotal <= 0) {
                if (errno != 11 && errno != 128) dmesg ("[httpConnection] recv error: ", errno, strerror (errno)); // don't record time-out, it often happens 
                goto endOfConnection;
              }

              endOfHttpRequest = strstr (ths->__httpRequestAndReplyBuffer__, "\r\n\r\n"); 
              if (!endOfHttpRequest) {
                  dmesg ("[httpConnection] __httpRequestAndReplyBuffer__ too small for HTTP request");
                  sendAll (ths->__connectionSocket__, reply507, HTTP_CONNECTION_TIME_OUT);
                  goto endOfConnection;
              }


                // WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET WEBSOCKET 
  
                if (stristr (ths->__httpRequestAndReplyBuffer__, (char *) "UPGRADE: WEBSOCKET")) {
                  WebSocket webSocket (ths->__connectionSocket__, ths->__httpRequestAndReplyBuffer__, ths->__clientIP__, ths->__serverIP__); 
                  if (webSocket.state () == WebSocket::RUNNING) {
                    if (ths->__wsRequestHandlerCallback__) ths->__wsRequestHandlerCallback__ (ths->__httpRequestAndReplyBuffer__, &webSocket);
                    else dmesg ("[httpConnection]", " wsRequestHandlerCallback was not provided to handle WebSocket");
                  }
                  goto endOfConnection;
                }
  
                // SEND HTTP REPLY FROM CALLBACK HANDLER SEND HTTP REPLY FROM CALLBACK HANDLER SEND HTTP REPLY FROM CALLBACK HANDLER 
            
                String httpReplyContent ("");
                if (ths->__httpRequestHandlerCallback__) {
                    httpReplyContent = ths->__httpRequestHandlerCallback__ (ths->__httpRequestAndReplyBuffer__, ths);
                    if (!httpReplyContent) { // out of memory
                        sendAll (ths->__connectionSocket__, reply503, HTTP_CONNECTION_TIME_OUT);
                        goto endOfConnection;
                    }
                }
                // DEBUG: Serial.printf ("[%s]\n", httpReplyContent.c_str ());

                if (httpReplyContent != "") {
                  // if Content-type was not provided during __httpRequestHandlerCallback__ try guessing what it is
                  if (!stristr ((char *) ths->__httpReplyHeader__.c_str (), (char *) "CONTENT-TYPE")) { 
                    if (stristr ((char *) httpReplyContent.c_str (), (char *) "<HTML>")) ths->setHttpReplyHeaderField ("Content-Type", "text/html");
                    else if (strstr ((char *) httpReplyContent.c_str (), "{"))           ths->setHttpReplyHeaderField ("Content-Type", "application/json");
                    // ... add more if needed
                    else                                                                 ths->setHttpReplyHeaderField ("Content-Type", "text/plain");
                  }
                  if (ths->__httpReplyHeader__.error ()) {
                      dmesg ("[httpConnection] __httpReplyHeader__ too small for HTTP reply header");
                      sendAll (ths->__connectionSocket__, reply507, HTTP_CONNECTION_TIME_OUT);
                      goto endOfConnection;
                  }
                  // construct the whole HTTP reply from differrent pieces and send it to client (browser)
                  // if the reply is short enough send it in one block, 
                  // if not send header first and then the content, so we won't have to move hughe blocks of data
                  unsigned long httpReplyContentLen = httpReplyContent.length ();

                  ths->__httpRequestAndReplyBuffer__ = "";
                  ths->__httpRequestAndReplyBuffer__ += "HTTP/1.1 ";
                  ths->__httpRequestAndReplyBuffer__ += ths->__httpReplyStatus__;
                  ths->__httpRequestAndReplyBuffer__ += "\r\n";
                  ths->__httpRequestAndReplyBuffer__ += ths->__httpReplyHeader__;
                  ths->__httpRequestAndReplyBuffer__ += "Content-Length: ";
                  ths->__httpRequestAndReplyBuffer__ += httpReplyContentLen; 
                  ths->__httpRequestAndReplyBuffer__ += "\r\n\r\n";

                  unsigned long httpReplyHeaderLen = ths->__httpRequestAndReplyBuffer__.length ();

                  // can not happen due to the difference in lengths, we can skip checking:
                  // if (ths->__httpRequestAndReplyBuffer__.error ()) {
                  //    dmesg ("[httpConnection] __httpRequestAndReplyBuffer__ too small");
                  //    sendAll (ths->__connectionSocket__, reply507, HTTP_CONNECTION_TIME_OUT);
                  //    goto endOfConnection;
                  // }

                  int bytesToCopyThisTime = min (httpReplyContentLen, (unsigned long) HTTP_BUFFER_SIZE - httpReplyHeaderLen); 
                  strncpy (&ths->__httpRequestAndReplyBuffer__ [httpReplyHeaderLen], (char *) httpReplyContent.c_str (), bytesToCopyThisTime);
                  ths->__httpRequestAndReplyBuffer__ [HTTP_BUFFER_SIZE] = 0;
                  if (sendAll (ths->__connectionSocket__, ths->__httpRequestAndReplyBuffer__, HTTP_CONNECTION_TIME_OUT) <= 0) {
                    dmesg ("[httpConnection] send error: ", errno, strerror (errno));
                    goto endOfConnection;
                  }
                  int bytesSent = bytesToCopyThisTime; // already sent
                  while (bytesSent < httpReplyContentLen) {
                    bytesToCopyThisTime = min (httpReplyContentLen - bytesSent, (unsigned long) 1500); // MTU = 1500, TCP_SND_BUF = 5744 (a maximum block size that ESP32 can send)
                    if (sendAll (ths->__connectionSocket__, httpReplyContent.c_str () + bytesSent, bytesToCopyThisTime, HTTP_CONNECTION_TIME_OUT) <= 0) {
                      dmesg ("[httpConnection] send error: ", errno, strerror (errno));
                      goto endOfConnection;
                    }                    
                    bytesSent += bytesToCopyThisTime; // already sent
                  }
                  // DEBUG: Serial.printf ("[httpConnection] reply length: %i\n", bytesSent);
                  // HTTP reply sent
                  goto nextHttpRequest;
                }

                // SEND HTTP REPLY FROM FILE SEND HTTP REPLY FROM FILE SEND HTTP REPLY FROM FILE SEND HTTP REPLY FROM FILE 
  
                #ifdef __FILE_SYSTEM__
                  if (fileSystem.mounted ()) {
                    if (strstr (ths->__httpRequestAndReplyBuffer__.c_str (), "GET ") == ths->__httpRequestAndReplyBuffer__.c_str ()) {
                      char *p = strstr (ths->__httpRequestAndReplyBuffer__.c_str () + 4, " ");
                      if (p) {
                        *p = 0;
                        // get file name from HTTP request
                        string fileName (ths->__httpRequestAndReplyBuffer__.c_str () + 4);
                        if (fileName == "" || fileName == "/") fileName = "/index.html";
                        fileName = string (ths->__httpServerHomeDirectory__) + (fileName.c_str () + 1); // __httpServerHomeDirectory__ always ends with /

