BojanJurca/Esp32_oscilloscope/httpServer.hpp
        int __listeningSocket__ = -1;

        static void __listenerTask__ (void *pvParameters) {
          {
            // get "this" pointer
            httpServer *ths = (httpServer *) pvParameters;  

            #ifdef WEB_SESSIONS
                // load database and start database cleaning task
                xTaskCreate ([] (void *param) { 
                                                  // load existing tokens
                                                  persistentKeyValuePairs<webSessionToken_t, webSessionTokenInformation_t>::errorCode e;
                                                  e = webSessionTokenDatabase.loadData ("/var/www/webSessionTokens.kvp");
                                                  if (e == webSessionTokenDatabase.OK) {
                                                      // DEBUG: Serial.printf ("[httpServer] webSessionCleaner: %i tokens loaded at startup\n", webSessionTokenDatabase.size ());
                                                  } else {
                                                      dmesg ("[httpServer] webSessionCleaner: webSessionTokenDatabase.loadData error: ", e);
                                                      dmesg ("[httpServer] webSessionCleaner: Truncating webSessionTokenDatabase");
                                                      webSessionTokenDatabase.Truncate (); // forget all stored data and try to make it work from the start
                                                  }

                                                  // periodically delete expired tokens
                                                  while (true) {
                                                      webSessionToken_t expiredToken;
                                                      webSessionTokenInformation_t webSessionTokenInformation;
                                                      persistentKeyValuePairs<webSessionToken_t, webSessionTokenInformation_t>::errorCode e;
                                                      for (auto p: webSessionTokenDatabase) {
                                                          e = webSessionTokenDatabase.FindValue (p.key, &webSessionTokenInformation, p.blockOffset);
                                                          if (e == webSessionTokenDatabase.OK && time () && webSessionTokenInformation.expires && webSessionTokenInformation.expires <= time ()) {
                                                              expiredToken = p.key;
                                                              break;
                                                          }  else {
                                                              // DEBUG: Serial.printf ("[httpServer] webSessionCleaner: token is stil valid %s for %i s\n", p.key, webSessionTokenInformation.expires - time ());
                                                          }
                                                      }
                                                      if (expiredToken > "") {
                                                          // DEBUG: Serial.printf ("[httpServer] webSessionCleaner: deleting expired token %s\n", expiredToken.c_str ());
                                                          webSessionTokenDatabase.Delete (expiredToken);
                                                      }

                                                      delay (6000); // repeat every 6 sec
                                                      // DEBUG: Serial.printf ("[httpServer] webSessionCleaner taks: stack high-water mark: %lu\n", uxTaskGetStackHighWaterMark (NULL));
                                                  }
                                              }, 
                                              "webSessionCleaner", 4 * 1024, NULL, 1, NULL);                
            #endif            
    
            // start listener
            ths->__listeningSocket__ = socket (PF_INET, SOCK_STREAM, 0);
            if (ths->__listeningSocket__ == -1) {
              dmesg ("[httpServer] socket error: ", errno, strerror (errno));
            } else {
              // make address reusable - so we won't have to wait a few minutes in case server will be restarted
              int flag = 1;
              if (setsockopt (ths->__listeningSocket__, SOL_SOCKET, SO_REUSEADDR, &flag, sizeof (flag)) == -1) {
                dmesg ("[httpServer] setsockopt error: ", errno, strerror (errno));
              } else {
                // bind listening socket to IP address and port     
                struct sockaddr_in serverAddress; 
                memset (&serverAddress, 0, sizeof (struct sockaddr_in));
                serverAddress.sin_family = AF_INET;
                serverAddress.sin_addr.s_addr = inet_addr (ths->__serverIP__);
                serverAddress.sin_port = htons (ths->__serverPort__);
                if (bind (ths->__listeningSocket__, (struct sockaddr *) &serverAddress, sizeof (serverAddress)) == -1) {
                  dmesg ("[httpServer] bind error: ", errno, strerror (errno));
               } else {
                 // mark socket as listening socket
                 if (listen (ths->__listeningSocket__, 12) == -1) {
                  dmesg ("[httpServer] listen error: ", errno, strerror (errno));
                 } else {
          
                  // listener is ready for accepting connections
                  ths->__state__ = RUNNING;
                  dmesg ("[httpServer] listener is running on core ", xPortGetCoreID ());
                  dmesg ("[httpServer] home (root) directory is ", ths->__httpServerHomeDirectory__); 
                  while (ths->__listeningSocket__ > -1) { // while listening socket is opened
          
                      int connectingSocket;
                      struct sockaddr_in connectingAddress;
                      socklen_t connectingAddressSize = sizeof (connectingAddress);
                      // DEBUG: Serial.printf ("[httpServer] listener taks: stack high-water mark: %lu\n", uxTaskGetStackHighWaterMark (NULL));
                      // while (heap_caps_get_largest_free_block (MALLOC_CAP_DEFAULT) < HTTP_CONNECTION_STACK_SIZE) delay (10); // there is no memory block large enough evailable to start a new task that would handle the new connection
                      connectingSocket = accept (ths->__listeningSocket__, (struct sockaddr *) &connectingAddress, &connectingAddressSize);
                      if (connectingSocket == -1) {
                        if (ths->__listeningSocket__ > -1) dmesg ("[httpServer] accept error: ", errno, strerror (errno));
                      } else {
                        socketTrafficInformation [ths->__listeningSocket__ - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();

