BojanJurca/Esp32_oscilloscope/httpServer.hpp
                        // prepare network Traffic measurement information for connecting socket
                        socketTrafficInformation [connectingSocket - LWIP_SOCKET_OFFSET] = {0, 0, millis (), millis ()};
                        // get client's IP address
                        char clientIP [46]; inet_ntoa_r (connectingAddress.sin_addr, clientIP, sizeof (clientIP)); 
                        // get server's IP address
                        char serverIP [46]; struct sockaddr_in thisAddress = {}; socklen_t len = sizeof (thisAddress);
                        if (getsockname (connectingSocket, (struct sockaddr *) &thisAddress, &len) != -1) inet_ntoa_r (thisAddress.sin_addr, serverIP, sizeof (serverIP));
                        // port number could also be obtained if needed: ntohs (thisAddress.sin_port);
                        if (ths->__firewallCallback__ && !ths->__firewallCallback__ (clientIP)) {
                          dmesg ("[httpServer] firewall rejected connection from ", clientIP);
                          close (connectingSocket);
                        } else {
                          // make the socket non-blocking so that we can detect time-out
                          if (fcntl (connectingSocket, F_SETFL, O_NONBLOCK) == -1) {
                            dmesg ("[httpServer] fcntl error: ", errno, strerror (errno));
                            close (connectingSocket);
                          } else {
                                // create httpConnection instence that will handle the connection, then we can lose reference to it - httpConnection will handle the rest
                                httpConnection *hcp = new (std::nothrow) httpConnection (connectingSocket, ths->__httpRequestHandlerCallback__, ths->__wsRequestHandlerCallback__, clientIP, serverIP, ths->__httpServerHomeDirectory__);
                                if (!hcp) {
                                  // dmesg ("[httpServer] new httpConnection error");
                                  sendAll (connectingSocket, reply503, HTTP_CONNECTION_TIME_OUT);
                                  close (connectingSocket); // normally httpConnection would do this but if it is not created we have to do it here
                                } else {
                                  if (hcp->state () != httpConnection::RUNNING) {
                                    sendAll (connectingSocket, reply503, HTTP_CONNECTION_TIME_OUT);
                                    delete (hcp); // normally httpConnection would do this but if it is not running we have to do it here
                                  } else {
                                    ; // httpConnection is running in its own task and will stop by itself 
                                  }
                                }
                                                               
                          } // fcntl
                        } // firewall
                      } // accept

                  } // while accepting connections
                  dmesg ("[httpServer] stopped");
          
                 } // listen
               } // bind
              } // setsockopt
              int listeningSocket;
              xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                listeningSocket = ths->__listeningSocket__;
                ths->__listeningSocket__ = -1;
              xSemaphoreGive (__httpServerSemaphore__);
              if (listeningSocket > -1) close (listeningSocket);
            } // socket
            ths->__state__ = NOT_RUNNING;
          }
          // stop the listening thread (task)
          vTaskDelete (NULL); // it is listener's responsibility to close itself          
        }
          
    };
    
#endif
